Version2/TestTool 1.2 Service Release/TestTool.Setup/Requests/Imaging Configuration/SetImagingSettings/TC.IC.NVT.02_REQ_28.xml

<?xml version='1.0' encoding='utf-8'?>
<s:Envelope
 xmlns:s="http://www.w3.org/2003/05/soap-envelope"
 xmlns:timg="http://www.onvif.org/ver10/imaging/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <timg:SetImagingSettings>
      <timg:VideoSourceToken>cam1</timg:VideoSourceToken>
      <timg:ImagingSettings>
        <WhiteBalance xmlns="http://www.onvif.org/ver10/schema">
          <!-- Attribute Wild card could not be matched. Generated XML may not be valid. -->
          <Mode>AUTO</Mode>
          <CrGain>1</CrGain>
          <CbGain>1</CbGain>
        </WhiteBalance>
      </timg:ImagingSettings>
    </timg:SetImagingSettings>
  </s:Body>
</s:Envelope>